package by.epamtc.iovchuk;

/**
 * <strong>Авиакомпания.</strong>
 * <br>
 * Определить иерархию самолетов. Создать авиакомпанию. Посчитать общую вместимость и грузоподъемность.
 * <br>
 * Провести сортировку самолетов компании на основе одного и нескольких параметров.
 * <br>
 * Найти самолет в компании, соответствующий заданному диапазону параметров потребления горючего.
 * <br>
 * <strong>Требования:</strong>
 * <br>
 * - При реализации иерархии наследования производный класс должен расширять суперкласс новыми свойствами,
 * для чего следует разобраться в предметной области задачи.
 * <br>
 * - Классы-сущности должны быть отделены от классов с методами бизнес-логики.
 * <br>
 * - Источником данных является файл(.txt). Среди данных в файле должна быть заведомо некорректная информация.
 * Должна присутствовать обработка некорректных данных инициализации объекта
 */
public class Main {
}
